src/test/java/features/WorkOrders/WO_Payloads/queryWO_usingSR_payload.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:max="http://www.ibm.com/maximo">
   <soapenv:Header />
   <soapenv:Body>
      <max:QueryYVWWORKORDER>
         <max:YVWWORKORDERQuery operandMode="AND">
            <max:WORKORDER>
               <max:ORIGRECORDID operator="=">#(srNum)</max:ORIGRECORDID>
            </max:WORKORDER>
         </max:YVWWORKORDERQuery>
      </max:QueryYVWWORKORDER>
   </soapenv:Body>
</soapenv:Envelope>